Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.this["helia-docker"] will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "helia-docker"
        name                        = "helia-docker"
        # (32 unchanged attributes hidden)

      ~ security_and_analysis {

          ~ secret_scanning {
              ~ status = "disabled" -> "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }
        }
    }

  # github_repository_file.this["helia-docker/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
                - cron: '0 0 * * *'
            
            permissions:
              issues: write
              pull-requests: write
            
            jobs:
              stale:
                uses: pl-strflt/.github/.github/workflows/reusable-stale-issue.yml@v0.3
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "helia-docker"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["rainbow/.github/workflows/stale.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      ~ commit_message      = "Update .github/workflows/stale.yml" -> "chore: Update .github/workflows/stale.yml [skip ci]"
        id                  = "rainbow/.github/workflows/stale.yml"
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->